Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.authentik.authentik_outpost.traefik will be updated in-place
~ resource "authentik_outpost" "traefik" {
        id                 = "5e9925db-1040-416e-a4f7-38a0372075c1"
        name               = "traefik-outpost"
      ~ protocol_providers = [
          - 5,
          - 2,
          - 7,
          - 4,
          - 3,
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.authentik.authentik_user.bill will be updated in-place
~ resource "authentik_user" "bill" {
      ~ groups     = [
          - "f0b5282d-8127-4c03-9c41-a299c37e6eed",
          - "47534021-782a-455d-9e16-1f77e1188e91",
          - "72ed71b4-81ce-46d1-afad-6803f4679cec",
          - "d1353c5d-8c7f-4363-8e73-2e3802e3cd56",
          - "d0b3dc82-d19c-4248-93c4-82c021245152",
          - "bebe7a48-4aac-428b-90c1-bfb80828355c",
          - "831286f3-e92e-4f3b-973b-b15993974801",
          - "82a3c37f-7b9d-45e4-be66-30f074fda939",
          - "550df717-232c-4a06-b854-c72c8ecf8d90",
          - "21ad337c-9285-4866-b233-9c221f1860a1",
          - "486385ad-a405-4159-8b76-a15e471cc072",
          - "35e977eb-87f1-40c6-a66a-e45231f0f5d5",
          - "e494149d-9524-4412-a6f8-0ea78948df42",
          - "ceee544f-5188-4c2b-9a0a-7cffe0d38d14",
          - "37143134-eddb-4ce5-ac20-544fb6524a9b",
          - "645f1710-288d-4b76-9c3d-21abd6e0faac",
        ] -> (known after apply)
        id         = "8"
        name       = "Bill Vandenberk"
        # (7 unchanged attributes hidden)
    }

  # module.meshcentral.kubernetes_manifest.certificate_meshcentral_billv_ca will be created
+ resource "kubernetes_manifest" "certificate_meshcentral_billv_ca" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "Certificate"
          + metadata   = {
              + name      = "meshcentral-billv-ca"
              + namespace = "meshcentral"
            }
          + spec       = {
              + dnsNames   = [
                  + "meshcentral.billv.ca",
                ]
              + issuerRef  = {
                  + kind = "ClusterIssuer"
                  + name = "letsencrypt"
                }
              + secretName = "meshcentral-billv-ca"
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "Certificate"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "meshcentral-billv-ca"
              + namespace                  = "meshcentral"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + additionalOutputFormats = (known after apply)
              + commonName              = (known after apply)
              + dnsNames                = [
                  + "meshcentral.billv.ca",
                ]
              + duration                = (known after apply)
              + emailAddresses          = (known after apply)
              + encodeUsagesInRequest   = (known after apply)
              + ipAddresses             = (known after apply)
              + isCA                    = (known after apply)
              + issuerRef               = {
                  + group = (known after apply)
                  + kind  = "ClusterIssuer"
                  + name  = "letsencrypt"
                }
              + keystores               = {
                  + jks    = {
                      + alias             = (known after apply)
                      + create            = (known after apply)
                      + passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + pkcs12 = {
                      + create            = (known after apply)
                      + passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + profile           = (known after apply)
                    }
                }
              + literalSubject          = (known after apply)
              + nameConstraints         = {
                  + critical  = (known after apply)
                  + excluded  = {
                      + dnsDomains     = (known after apply)
                      + emailAddresses = (known after apply)
                      + ipRanges       = (known after apply)
                      + uriDomains     = (known after apply)
                    }
                  + permitted = {
                      + dnsDomains     = (known after apply)
                      + emailAddresses = (known after apply)
                      + ipRanges       = (known after apply)
                      + uriDomains     = (known after apply)
                    }
                }
              + otherNames              = (known after apply)
              + privateKey              = {
                  + algorithm      = (known after apply)
                  + encoding       = (known after apply)
                  + rotationPolicy = (known after apply)
                  + size           = (known after apply)
                }
              + renewBefore             = (known after apply)
              + renewBeforePercentage   = (known after apply)
              + revisionHistoryLimit    = (known after apply)
              + secretName              = "meshcentral-billv-ca"
              + secretTemplate          = {
                  + annotations = (known after apply)
                  + labels      = (known after apply)
                }
              + subject                 = {
                  + countries           = (known after apply)
                  + localities          = (known after apply)
                  + organizationalUnits = (known after apply)
                  + organizations       = (known after apply)
                  + postalCodes         = (known after apply)
                  + provinces           = (known after apply)
                  + serialNumber        = (known after apply)
                  + streetAddresses     = (known after apply)
                }
              + uris                    = (known after apply)
              + usages                  = (known after apply)
            }
        }
    }

  # module.meshcentral.kubernetes_manifest.ingressroute will be created
+ resource "kubernetes_manifest" "ingressroute" {
      + manifest = {
          + apiVersion = "traefik.containo.us/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + name      = "meshcentral"
              + namespace = "meshcentral"
            }
          + spec       = {
              + entryPoints = [
                  + "websecure",
                ]
              + routes      = [
                  + {
                      + kind        = "Rule"
                      + match       = "Host(`meshcentral.billv.ca`)"
                      + middlewares = [
                          + {
                              + name      = "authentik"
                              + namespace = "meshcentral"
                            },
                        ]
                      + services    = [
                          + {
                              + kind             = "Service"
                              + name             = "meshcentral"
                              + port             = 443
                              + scheme           = "https"
                              + serversTransport = "meshcentral"
                            },
                        ]
                    },
                ]
              + tls         = {
                  + secretName = "meshcentral-billv-ca"
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.containo.us/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "meshcentral"
              + namespace                  = "meshcentral"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + entryPoints = [
                  + "websecure",
                ]
              + routes      = [
                  + {
                      + kind        = "Rule"
                      + match       = "Host(`meshcentral.billv.ca`)"
                      + middlewares = [
                          + {
                              + name      = "authentik"
                              + namespace = "meshcentral"
                            },
                        ]
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = "Service"
                              + name               = "meshcentral"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "443"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = "https"
                              + serversTransport   = "meshcentral"
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
              + tls         = {
                  + certResolver = (known after apply)
                  + domains      = (known after apply)
                  + options      = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + secretName   = "meshcentral-billv-ca"
                  + store        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
            }
        }
    }

  # module.meshcentral.kubernetes_manifest.servers_transport will be created
+ resource "kubernetes_manifest" "servers_transport" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "ServersTransport"
          + metadata   = {
              + name      = "meshcentral"
              + namespace = "meshcentral"
            }
          + spec       = {
              + insecureSkipVerify = "true"
              + serverName         = "meshcentral.meshcentral.svc.cluster.local"
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "ServersTransport"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "meshcentral"
              + namespace                  = "meshcentral"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + certificatesSecrets = (known after apply)
              + disableHTTP2        = (known after apply)
              + forwardingTimeouts  = {
                  + dialTimeout           = (known after apply)
                  + idleConnTimeout       = (known after apply)
                  + pingTimeout           = (known after apply)
                  + readIdleTimeout       = (known after apply)
                  + responseHeaderTimeout = (known after apply)
                }
              + insecureSkipVerify  = true
              + maxIdleConnsPerHost = (known after apply)
              + peerCertURI         = (known after apply)
              + rootCAsSecrets      = (known after apply)
              + serverName          = "meshcentral.meshcentral.svc.cluster.local"
            }
        }
    }

  # module.meshcentral.kubernetes_service_v1.meshcentral will be updated in-place
~ resource "kubernetes_service_v1" "meshcentral" {
        id                     = "meshcentral/meshcentral"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "metallb.universe.tf/loadBalancerIPs" = "10.206.101.4" -> null
            }
            name             = "meshcentral"
            # (6 unchanged attributes hidden)
        }

      ~ spec {
          ~ type                              = "LoadBalancer" -> "ClusterIP"
            # (16 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.authentik.module.meshcentral.authentik_application.app will be created
+ resource "authentik_application" "app" {
      + group              = "Home Services"
      + id                 = (known after apply)
      + meta_icon          = "https://lh3.googleusercontent.com/2wMN7cAlupHliEsK4391xQz8PauJxC-RNQluK2P6jX1HoGlztrm_t5bLxIptWyrP59wnVQ=w16383"
      + meta_launch_url    = "https://meshcentral.billv.ca"
      + name               = "MeshCentral"
      + open_in_new_tab    = false
      + policy_engine_mode = "any"
      + protocol_provider  = (known after apply)
      + slug               = "meshcentral"
      + uuid               = (known after apply)
    }

  # module.authentik.module.meshcentral.authentik_group.app_access will be created
+ resource "authentik_group" "app_access" {
      + attributes   = jsonencode({})
      + id           = (known after apply)
      + is_superuser = false
      + name         = "MeshCentral_access"
      + users        = (known after apply)
    }

  # module.authentik.module.meshcentral.authentik_policy_binding.app-access will be created
+ resource "authentik_policy_binding" "app-access" {
      + enabled        = true
      + failure_result = false
      + group          = (known after apply)
      + id             = (known after apply)
      + negate         = false
      + order          = 0
      + target         = (known after apply)
      + timeout        = 30
    }

  # module.authentik.module.meshcentral.authentik_provider_proxy.app will be created
+ resource "authentik_provider_proxy" "app" {
      + access_token_validity        = "minutes=10"
      + authorization_flow           = "f076b73f-1888-4e7a-818d-24525dfd192f"
      + basic_auth_enabled           = false
      + client_id                    = (known after apply)
      + cookie_domain                = "billv.ca"
      + external_host                = "https://meshcentral.billv.ca"
      + id                           = (known after apply)
      + intercept_header_auth        = true
      + internal_host_ssl_validation = true
      + invalidation_flow            = "9b8c28d9-3278-40ea-bc9f-7576045f941b"
      + mode                         = "forward_single"
      + name                         = "meshcentral"
      + property_mappings            = [
          + "f80368b5-2d60-4a62-95e2-e05556f616b4",
          + "c3957a58-215b-49bd-8cc1-b943f08f1d60",
          + "8980704e-6c9f-499a-b8bd-7da818a5842a",
          + "90297242-b45a-404b-a92b-e51029a795f8",
          + "dd28e59c-6c03-4876-89e8-ab486b41c8b5",
        ]
      + refresh_token_validity       = "hours=1"
    }

  # module.authentik.module.meshcentral.kubernetes_manifest.middleware_authentik will be created
+ resource "kubernetes_manifest" "middleware_authentik" {
      + manifest = {
          + apiVersion = "traefik.containo.us/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "authentik"
              + namespace = "meshcentral"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://ak-outpost-traefik-outpost.authentik.svc.cluster.local:9000/outpost.goauthentik.io/auth/traefik"
                  + authResponseHeaders = [
                      + "X-authentik-username",
                      + "X-authentik-groups",
                      + "X-authentik-email",
                      + "X-authentik-name",
                      + "X-authentik-uid",
                      + "X-authentik-jwt",
                      + "X-authentik-meta-jwks",
                      + "X-authentik-meta-outpost",
                      + "X-authentik-meta-provider",
                      + "X-authentik-meta-app",
                      + "X-authentik-meta-version",
                    ]
                  + trustForwardHeader  = true
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.containo.us/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "authentik"
              + namespace                  = "meshcentral"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                }
              + compress          = {
                  + excludedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query   = (known after apply)
                  + service = {
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + httpOnly = (known after apply)
                              + name     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status  = (known after apply)
                }
              + forwardAuth       = {
                  + address                  = "http://ak-outpost-traefik-outpost.authentik.svc.cluster.local:9000/outpost.goauthentik.io/auth/traefik"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-authentik-username",
                      + "X-authentik-groups",
                      + "X-authentik-email",
                      + "X-authentik-name",
                      + "X-authentik-uid",
                      + "X-authentik-jwt",
                      + "X-authentik-meta-jwks",
                      + "X-authentik-meta-outpost",
                      + "X-authentik-meta-provider",
                      + "X-authentik-meta-app",
                      + "X-authentik-meta-version",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = true
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

Plan: 8 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 8 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```